app/views/kitchen_drinks/index.html.erb

SELECT  "drinks_orders".* FROM "drinks_orders" WHERE "drinks_orders"."order_id" = ?  ORDER BY "drinks_orders"."id" ASC LIMIT 1  [["order_id", 1]]
SELECT "orders".* FROM "orders"  ORDER BY "orders"."created_at" DESC
---
    <div class="col-md-4">
      <% if order.drinks_orders.first.try(:status) == 0 %>