app/views/users/_form.html.erb

SELECT  "roles".* FROM "roles" WHERE "roles"."user_id" = ? LIMIT 1  [["user_id", 1]]
---
    <%= f.label :role %><br>
    <%= f.select :role_id, options_for_select( Role.all.map { |role| [role.name, role.id] }, f.object.role_id), {}, {class: "form-control"} %>