app/views/orders/_drinks_order_fields.html.erb

SELECT "drinks".* FROM "drinks"
---
  <%= f.label :drink %>
  <%= f.select :drink_id, options_for_select(Drink.all.map{|d| [d.name, d.id]}, f.object.drink_id)%>