app/views/orders/_foods_order_fields.html.erb

  <%= f.label :food %>
  <%= f.select :food_id, options_for_select(Food.all.map{|c| [c.name, c.id]}, f.object.food_id), {}, {class: "form-control selectpicker",	"data-live-search" => "true" } %>
---
SELECT "foods".* FROM "foods"