app/views/orders/index.html.erb

SELECT  "drinks_orders".* FROM "drinks_orders" WHERE "drinks_orders"."order_id" = ?  ORDER BY "drinks_orders"."id" ASC LIMIT 1  [["order_id", 1]]
SELECT  "foods_orders".* FROM "foods_orders" WHERE "foods_orders"."order_id" = ?  ORDER BY "foods_orders"."id" ASC LIMIT 1  [["order_id", 1]]
SELECT "orders".* FROM "orders"
---
          <% @orders.each do |order| %>
            <% if order.foods_orders.first.try(:status) == 0 || order.drinks_orders.first.try(:status) == 0 %>