app/views/orders/show.html.erb

SELECT "foods_orders".* FROM "foods_orders" WHERE "foods_orders"."order_id" = ?  [["order_id", 1]]
---
  <div class="tcenter">
    <% if @order.foods_orders.present? %>

SELECT "drinks_orders".* FROM "drinks_orders" WHERE "drinks_orders"."order_id" = ?  [["order_id", 1]]
---
  <div class="tcenter">
    <% if @order.drinks_orders.present? %>