app/views/kitchen_foods/index.html.erb

    <div class="col-md-4">
      <% if order.foods_orders.first.try(:status) == 0 %>
---
SELECT  "foods_orders".* FROM "foods_orders" WHERE "foods_orders"."order_id" = ?  ORDER BY "foods_orders"."id" ASC LIMIT 1  [["order_id", 1]]
SELECT "orders".* FROM "orders"  ORDER BY "orders"."created_at" ASC