app/controllers/drinks_controller.rb

SELECT "drinks".* FROM "drinks"
---
  def index
    @drinks = Drink.all

INSERT INTO "drinks" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Sirap"], ["created_at", "2015-07-31 07:12:08.865230"], ["updated_at", "2015-07-31 07:12:08.865230"]]
---
  def create
    @drink = Drink.new(drink_params)

    respond_to do |format|
      if @drink.save

UPDATE "drinks" SET "name" = ?, "updated_at" = ? WHERE "drinks"."id" = ?  [["name", "Sirap2"], ["updated_at", "2015-08-04 13:37:13.852930"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @drink.update(drink_params)

DELETE FROM "drinks" WHERE "drinks"."id" = ?  [["id", 1]]
---
  def destroy
    @drink.destroy

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_drink
      @drink = Drink.find(params[:id])