app/controllers/foods_controller.rb

INSERT INTO "foods" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Nasi Ayam"], ["created_at", "2015-07-31 07:11:40.678898"], ["updated_at", "2015-07-31 07:11:40.678898"]]
---
  def create
    @food = Food.new(food_params)

    respond_to do |format|
      if @food.save

UPDATE "foods" SET "name" = ?, "updated_at" = ? WHERE "foods"."id" = ?  [["name", "Nasi Ayam2"], ["updated_at", "2015-08-04 13:25:04.055016"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @food.update(food_params)

DELETE FROM "foods" WHERE "foods"."id" = ?  [["id", 4]]
---
  def destroy
    @food.destroy