app/controllers/kitchen_foods_controller.rb

  def index
  	@orders = Order.all.order(created_at: :asc)
---
SELECT "orders".* FROM "orders"  ORDER BY "orders"."created_at" ASC