app/controllers/kitchen_drinks_controller.rb

SELECT "orders".* FROM "orders"  ORDER BY "orders"."created_at" DESC
---
  def index
  	@orders = Order.all.order(created_at: :asc)