app/controllers/orders_controller.rb

INSERT INTO "orders" ("table_number", "created_at", "updated_at") VALUES (?, ?, ?)  [["table_number", 1], ["created_at", "2015-07-31 07:49:37.666359"], ["updated_at", "2015-07-31 07:49:37.666359"]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save

UPDATE "orders" SET "table_number" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["table_number", 1], ["updated_at", "2015-08-04 13:59:53.336460"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @order.update(order_params)

SELECT "orders".* FROM "orders"
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "foods_orders" SET "status" = 1 WHERE "foods_orders"."order_id" = 4
---
  def update_foods_status
    @orders = Order.all
    order_id = Order.find(params[:id])
    FoodsOrder.where(order_id: order_id).update_all(:status => 1)

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "drinks_orders" SET "status" = 1 WHERE "drinks_orders"."order_id" = 4
---
  def update_drinks_status
    @orders = Order.all
    order_id = Order.find(params[:id])
    DrinksOrder.where(order_id: order_id).update_all(:status => 1)