app/controllers/users_controller.rb

UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "manager2@example.com"], ["updated_at", "2015-08-07 09:35:43.528058"], ["id", 2]]
---
  def update
    #raise
    respond_to do |format|
      if @user.update(user_params)